app/Models/CommentModel.php

SELECT *
FROM `commented`
JOIN `users` ON `commented`.`userId` = `users`.`userId`
---
    public function viewComment()
    {
        return $this->db->table('commented')
        ->join('users','commented.userId = users.userId')
        ->get()->getResultArray();