app/Models/NotificationModel.php

    public function viewNotification()
    {
        return $this->db->table('notification')
        ->join('users','notification.userId = users.userId')
        ->select('notification.notificateId,notification.notificateDetail,notification.statusNotic,notification.userId,notification.notificationDate')
        ->get()->getResultArray();
---
SELECT `notification`.`notificateId`, `notification`.`notificateDetail`, `notification`.`statusNotic`, `notification`.`userId`, `notification`.`notificationDate`
FROM `notification`
JOIN `users` ON `notification`.`userId` = `users`.`userId`