app/Models/ParticModel.php

SELECT `participate`.`partId`, `participate`.`userId_user`, `participate`.`statusPart`, `users`.`userId`, `users`.`FName`, `users`.`userImage`, `post`.`postTitle`, `post`.`userId_user`
FROM `participate`
JOIN `users` ON `participate`.`userId_user` = `users`.`userId`
JOIN `post` ON `participate`.`postId_post` = `post`.`postId`
WHERE `statusPart` = '0'
ORDER BY `partId` ASC
---
    public function viewPartic()
    {
        return $this->db->table('participate')
        ->select("participate.partId,participate.userId_user,participate.statusPart,users.userId,users.FName,users.userImage,post.postTitle,post.userId_user")
        ->join('users','participate.userId_user = users.userId')
        ->join('post','participate.postId_post = post.postId')
        ->where('statusPart','0')
        ->orderBy('partId','ASC' )
        ->get()->getResultArray();

SELECT `participate`.`partId`, `participate`.`userId_user`, `participate`.`statusPart`, `participate`.`postId_post`, `post`.`postId`, `post`.`postTitle`, `post`.`imagePost`, `post`.`date_start`, `post`.`date_end`, `post`.`num_people`, `post`.`userId`, `post`.`creation_date`, `post`.`province`, `post`.`statusPost`, `users`.`FName`, `users`.`LName`, `users`.`userImage`, `provinces`.`name_th`
FROM `participate`
JOIN `post` ON `participate`.`postId_post` = `post`.`postId`
JOIN `users` ON `post`.`userId` = `users`.`userId`
JOIN `provinces` ON `post`.`province` = `provinces`.`Id`
WHERE `statusPart` = '1'
AND `post`.`statusPost` = '0'
AND `participate`.`userId_user` = '42'
ORDER BY `partId` ASC
---
    public function viewHistoryPartic($id)
    {
        return $this->db->table('participate')
        ->select("participate.partId,participate.userId_user,participate.statusPart,participate.postId_post
        ,post.postId,post.postTitle,post.imagePost,post.date_start,post.date_end,post.num_people,post.userId,post.creation_date,post.province,post.statusPost
        ,users.FName,users.LName,users.userImage
        ,provinces.name_th")
        ->join('post','participate.postId_post = post.postId')
        ->join('users','post.userId = users.userId')
        ->join('provinces','post.province = provinces.Id')
        ->where('statusPart','1')
        ->where('post.statusPost','0')
        ->where('participate.userId_user',$id)
        ->orderBy('partId','ASC' )
        ->get()->getResultArray();

SELECT *
FROM `participate`
JOIN `users` ON `participate`.`userId_user` = `users`.`userId`
WHERE `statusPart` = '1'
ORDER BY `partId` ASC
---
    public function viewProfilePartic()
    {
        return $this->db->table('participate')
        ->join('users','participate.userId_user = users.userId')
        ->orderBy('partId','ASC' )
        ->where('statusPart','1')
        ->get()->getResultArray();

SELECT `participate`.`partId`, `participate`.`userId_user`, `participate`.`statusPart`, `participate`.`postId_post`, `post`.`postId`, `post`.`postTitle`, `post`.`imagePost`, `post`.`date_start`, `post`.`date_end`, `post`.`num_people`, `post`.`userId`, `post`.`creation_date`, `post`.`province`, `post`.`statusPost`, `users`.`FName`, `users`.`LName`, `users`.`userImage`, `provinces`.`name_th`
FROM `participate`
JOIN `post` ON `participate`.`postId_post` = `post`.`postId`
JOIN `users` ON `post`.`userId` = `users`.`userId`
JOIN `provinces` ON `post`.`province` = `provinces`.`Id`
WHERE `statusPart` = '0'
AND `post`.`statusPost` = '1'
AND `participate`.`userId_user` = '40'
ORDER BY `partId` ASC
---
    public function viewRequestPartic($id)
    {
        return $this->db->table('participate')
        ->select("participate.partId,participate.userId_user,participate.statusPart,participate.postId_post
        ,post.postId,post.postTitle,post.imagePost,post.date_start,post.date_end,post.num_people,post.userId,post.creation_date,post.province,post.statusPost
        ,users.FName,users.LName,users.userImage
        ,provinces.name_th")
        ->join('post','participate.postId_post = post.postId')
        ->join('users','post.userId = users.userId')
        ->join('provinces','post.province = provinces.Id')
        ->where('statusPart','0')
        ->where('post.statusPost','1')
        ->where('participate.userId_user',$id)
        ->orderBy('partId','ASC')
        ->get()->getResultArray();

SELECT `participate`.`partId`, `participate`.`userId_user`, `participate`.`statusPart`, `participate`.`postId_post`, `post`.`postId`, `post`.`postTitle`, `post`.`imagePost`, `post`.`date_start`, `post`.`date_end`, `post`.`num_people`, `post`.`userId`, `post`.`creation_date`, `post`.`province`, `post`.`statusPost`, `post`.`QRCodeImage`, `users`.`FName`, `users`.`LName`, `users`.`userImage`, `provinces`.`name_th`
FROM `participate`
JOIN `post` ON `participate`.`postId_post` = `post`.`postId`
JOIN `users` ON `post`.`userId` = `users`.`userId`
JOIN `provinces` ON `post`.`province` = `provinces`.`Id`
WHERE `statusPart` = '1'
AND `post`.`statusPost` = '1'
AND `participate`.`userId_user` = '44'
ORDER BY `partId` ASC
---
    public function viewPostParticActive($id)
    {
        return $this->db->table('participate')
        ->select("participate.partId,participate.userId_user,participate.statusPart,participate.postId_post
        ,post.postId,post.postTitle,post.imagePost,post.date_start,post.date_end,post.num_people,post.userId,post.creation_date,post.province,post.statusPost,post.QRCodeImage
        ,users.FName,users.LName,users.userImage
        ,provinces.name_th")
        ->join('post','participate.postId_post = post.postId')
        ->join('users','post.userId = users.userId')
        ->join('provinces','post.province = provinces.Id')
        ->where('statusPart','1')
        ->where('post.statusPost','1')
        ->where('participate.userId_user',$id)
        ->orderBy('partId','ASC' )
        ->get()->getResultArray();