app/Models/PostModel.php

    public function viewPost()
    {
        return $this->db->table('post')
        ->join('provinces','post.province = provinces.id')
        ->join('users','post.userId = users.userId')
        ->join('category','post.categoryId = category.categoryId')
        ->join('amphures','post.district = amphures.id')
        ->join('districts','post.subDistrict = districts.id')
        ->orderBy('postId','DESC' )
        ->where('statusPost','1')
        ->get()->getResultArray();
---
SELECT *
FROM `post`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `users` ON `post`.`userId` = `users`.`userId`
JOIN `category` ON `post`.`categoryId` = `category`.`categoryId`
JOIN `amphures` ON `post`.`district` = `amphures`.`id`
JOIN `districts` ON `post`.`subDistrict` = `districts`.`id`
WHERE `statusPost` = '1'
ORDER BY `postId` DESC

    public function viewMyPost($id)
    {
        return $this->db->table('post')
        ->join('provinces','post.province = provinces.id')
        ->join('users','post.userId = users.userId')
        ->join('category','post.categoryId = category.categoryId')
        ->join('amphures','post.district = amphures.id')
        ->join('districts','post.subDistrict = districts.id')
        ->orderBy('postId','DESC' )
        ->where('userId_user',$id)
        ->get()->getResultArray();
---
SELECT *
FROM `post`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `users` ON `post`.`userId` = `users`.`userId`
WHERE `userId_user` = '42'
ORDER BY `postId` DESC

    public function viewPostSingle($postId)
    {
        return $this->db->table('post')
        ->join('provinces','post.province = provinces.id')
        ->join('amphures','post.district = amphures.id')
        ->join('districts','post.subDistrict = districts.id')
        ->join('users','post.userId = users.userId')
        ->join('category','post.categoryId = category.categoryId')
        ->orderBy('postId','DESC' )
        ->where('postId',$postId)
        ->get()->getResultArray();
---
SELECT *
FROM `post`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `amphures` ON `post`.`district` = `amphures`.`id`
JOIN `districts` ON `post`.`subDistrict` = `districts`.`id`
JOIN `users` ON `post`.`userId` = `users`.`userId`
JOIN `category` ON `post`.`categoryId` = `category`.`categoryId`
WHERE `postId` = '75'
ORDER BY `postId` DESC

    public function viewPostReview($id)
    {
        return $this->db->table('post')
        ->join('provinces','post.province = provinces.id')
        ->join('users','post.userId = users.userId')
        ->orderBy('postId','DESC' )
        ->where('statusPost','0')
        ->where('userId_user',$id)
        ->get()->getResultArray();
---
SELECT *
FROM `post`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `users` ON `post`.`userId` = `users`.`userId`
WHERE `statusPost` = '0'
AND `userId_user` = '42'
ORDER BY `postId` DESC

    public function viewMyPostActive($id)
    {
        return $this->db->table('post')
        ->join('provinces','post.province = provinces.id')
        ->join('users','post.userId = users.userId')
        ->join('category','post.categoryId = category.categoryId')
        ->join('amphures','post.district = amphures.id')
        ->join('districts','post.subDistrict = districts.id')
        ->orderBy('postId','DESC' )
        ->where('statusPost','1')
        ->where('userId_user',$id)
        ->get()->getResultArray();
---
SELECT *
FROM `post`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `users` ON `post`.`userId` = `users`.`userId`
JOIN `category` ON `post`.`categoryId` = `category`.`categoryId`
JOIN `amphures` ON `post`.`district` = `amphures`.`id`
JOIN `districts` ON `post`.`subDistrict` = `districts`.`id`
WHERE `statusPost` = '1'
AND `userId_user` = '40'
ORDER BY `postId` DESC