app/Models/ReviewModel.php

SELECT *
FROM `review`
JOIN `users` ON `review`.`userId` = `users`.`userId`
---
    public function viewReview()
    {
        return $this->db->table('review')
        ->join('users','review.userId = users.userId')
        ->get()->getResultArray();

INSERT INTO `review` (`point`, `detail_review`, `userId`, `postId`) VALUES ('4', '111111111111111', '42', '44')
---
    public function insertReview($dataReview)
    {
        $this->insert($dataReview);