app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `userName` = 'kanokphon'
 LIMIT 1
---
    public function login($userName,$password){
        $data = $this->where('userName', $userName)->first();

SELECT *
FROM `users`
JOIN `provinces` ON `users`.`province` = `provinces`.`id`
WHERE `province` = '58'
---
    public function getProvince($numprovince){
        return $this->db->table('users')
        ->join('provinces','users.province = provinces.id')
        ->where('province' ,$numprovince)
        ->get()->getResultArray();

SELECT *
FROM `users`
JOIN `provinces` ON `users`.`province` = `provinces`.`id`
JOIN `amphures` ON `users`.`district` = `amphures`.`id`
JOIN `districts` ON `users`.`subDistrict` = `districts`.`id`
WHERE `userId` = '46'
---
    public function getProfile($userId){
        return $this->db->table('users')
        ->join('provinces','users.province = provinces.id')
        ->join('amphures','users.district = amphures.id')
        ->join('districts','users.subDistrict = districts.id')
        ->where('userId' ,$userId)
        ->get()->getResultArray();